global i
i=3
def Z():
    global i
    while i>0:
        b = input("ответ ")
        if b == l:
            print("Угадал")
            break
        else:
            print("Не угадал, - 1 жизнь")
            i = i-1
            if i==0:
                print("GAME OVER")
        return(i)    
print("У броненосца две передние ноги, две задние, да еще две левые и две правые. Сколько ног всего?")
l = "четыре"
Z()
if  i > 0:
    print("Горело 5 электрических лампочек, три лампочки выключили. Сколько лампочек осталось?")
    l = "Пять"
    Z()
if i>0:
    print("У мамы Гали есть три дочери. Одну из них зовут Света, другую – Лена. Как зовут третью?")
    l = "Галя"
    Z()
