x = int(input())
if x > 999 and x < 10000:
   a = x % 10
   b = x // 10 % 10
   c = x // 100 % 10
   d = x // 1000
else:
    print("Wrong Number")
if a+b == c+d:
    print("Сумма двух первых цифр равна сумме двух последних")
else:
    print("Сумма двух первых цифр не равна сумме двух последних")
if (a+b+c+d) % 3 == 0:
    print("Сумма цифр кратна 3")
else:
    print("Сумма цифр не кратна 3")
if (a*b*c*d) % 4 == 0:
    print("Произведение цифр кратно четырем")
else:
    print("Произведение цифр не кратно четырем")
if (a*b*c*d) % a == 0:
    print("Произведение цифр кратно a")
else:
    print("1000-7 я аниме псих. произведение цифр не кратно a")


